import numpy as np

####################################################################
## 행렬 곱 ##
A = np.array([[1, 2], [3, 4]])
print("A shape = ", A.shape)
B = np.array([[5, 6], [7, 8]])
print("B shape = ", B.shape)
## np.dot()은 행렬의 곱을 계산해주는 함수 ##
print("A X B = ", np.dot(A, B))

## A의 행과 B의 열의 형상이 같아야 곱이 가능 ##
A = np.array([[1, 2], [3, 4]])
B = np.array([[5, 6], [7, 8], [9, 10]])

if(A.shape[1] == B.shape[0]):
    print("B X A = ", np.dot(B, A))
elif (A.shape[0] == B.shape[1]):
    print("Shape different!")
####################################################################

####################################################################